z80/micropython/ports/stm32/boards/F405_OVERRIDE/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME       "F405_OVERRIDE"
#define MICROPY_HW_MCU_NAME         "STM32F405RG"

#define MICROPY_HW_HAS_SWITCH       (0)
#define MICROPY_HW_HAS_FLASH        (1)
#define MICROPY_HW_HAS_MMA7660      (0)
#define MICROPY_HW_ENABLE_RNG       (1)
#define MICROPY_HW_ENABLE_RTC       (1)
#define MICROPY_HW_ENABLE_SERVO     (1)
#define MICROPY_HW_ENABLE_ADC       (1)
#define MICROPY_HW_ENABLE_DAC       (1)
#define MICROPY_HW_ENABLE_USB       (1)
#define MICROPY_HW_ENABLE_SDCARD    (0)

// HSE is 8MHz
#define MICROPY_HW_CLK_PLLM (8)
#define MICROPY_HW_CLK_PLLN (336)
#define MICROPY_HW_CLK_PLLP (RCC_PLLP_DIV2)
#define MICROPY_HW_CLK_PLLQ (7)

// The pyboard has a 32kHz crystal for the RTC
#define MICROPY_HW_RTC_USE_LSE      (1)

// UART config
#define MICROPY_HW_UART1_TX     (pin_A9)
#define MICROPY_HW_UART1_RX     (pin_A10)
#define MICROPY_HW_UART2_TX     (pin_A2)
#define MICROPY_HW_UART2_RX     (pin_A3)
#define MICROPY_HW_UART2_RTS    (pin_A1)
#define MICROPY_HW_UART2_CTS    (pin_A0)
#define MICROPY_HW_UART3_TX     (pin_B10)
#define MICROPY_HW_UART3_RX     (pin_B11)
#define MICROPY_HW_UART3_RTS    (pin_B14)
#define MICROPY_HW_UART3_CTS    (pin_B13)
#define MICROPY_HW_UART4_TX     (pin_A0)
#define MICROPY_HW_UART4_RX     (pin_A1)
#define MICROPY_HW_UART6_TX     (pin_C6)
#define MICROPY_HW_UART6_RX     (pin_C7)

// X-skin: X9=PB6=SCL, X10=PB7=SDA
#define MICROPY_HW_I2C1_SCL (pin_B6)
#define MICROPY_HW_I2C1_SDA (pin_B7)

// Y-skin: Y9=PB10=SCL, Y10=PB11=SDA
#define MICROPY_HW_I2C2_SCL (pin_B10)
#define MICROPY_HW_I2C2_SDA (pin_B11)

// SPI buses
#define MICROPY_HW_SPI1_NAME "X"
#define MICROPY_HW_SPI1_NSS  (pin_A4) // X5
#define MICROPY_HW_SPI1_SCK  (pin_A5) // X6
#define MICROPY_HW_SPI1_MISO (pin_A6) // X7
#define MICROPY_HW_SPI1_MOSI (pin_A7) // X8
#define MICROPY_HW_SPI2_NAME "Y"
#define MICROPY_HW_SPI2_NSS  (pin_B12) // Y5
#define MICROPY_HW_SPI2_SCK  (pin_B13) // Y6
#define MICROPY_HW_SPI2_MISO (pin_C2) // Y7
#define MICROPY_HW_SPI2_MOSI (pin_C3) // Y8

// CAN buses
#define MICROPY_HW_CAN1_TX (pin_B9) // Y4
#define MICROPY_HW_CAN1_RX (pin_B8) // Y3
#define MICROPY_HW_CAN2_TX (pin_B13) // Y6
#define MICROPY_HW_CAN2_RX (pin_B12) // Y5

// USRSW has no pullup or pulldown, and pressing the switch makes the input go low
#define MICROPY_HW_USRSW_PIN        (pin_A13)
#define MICROPY_HW_USRSW_PULL       (GPIO_PULLUP)
#define MICROPY_HW_USRSW_EXTI_MODE  (GPIO_MODE_IT_FALLING)
#define MICROPY_HW_USRSW_PRESSED    (0)

// LEDs
#define MICROPY_HW_LED_INVERTED     (0) // LEDs are on when pin is driven low
#define MICROPY_HW_LED1             (pin_A15)  // R1 - red
#define MICROPY_HW_LED2             (pin_C10) // R2 - red
//#define MICROPY_HW_LED1_PWM         { TIM1, 1, TIM_CHANNEL_1, GPIO_AF1_TIM1 }
//#define MICROPY_HW_LED2_PWM         { TIM1, 1, TIM_CHANNEL_3, GPIO_AF1_TIM1 }
#define MICROPY_HW_LED_ON(pin)      (mp_hal_pin_high(pin))
#define MICROPY_HW_LED_OFF(pin)     (mp_hal_pin_low(pin))


// USB VBUS detect pin
#define MICROPY_HW_USB_FS              (1)
//#define MICROPY_HW_USB_VBUS_DETECT_PIN (pin_A9)

// MMA accelerometer config
//#define MICROPY_HW_MMA_AVDD_PIN     (pin_B5)





#define MICROPY_HW_ENABLE_INTERNAL_FLASH_STORAGE (0)

// External SPI flash on SPI2
#define MICROPY_HW_SPIFLASH_CS    (pin_B12)
#define MICROPY_HW_SPIFLASH_SCK   (pin_B13)
#define MICROPY_HW_SPIFLASH_MOSI  (pin_C3)
#define MICROPY_HW_SPIFLASH_MISO  (pin_C2)
#define MICROPY_HW_SPIFLASH_BUS   (2) // SPI2
// This setting makes SPI2 reserved and it is not de-initialized.
// The user also cannot access it.
// For access and not deinitialized need to use MICROPY_HW_SPI_IS_STATIC(id)
#define MICROPY_HW_SPI_IS_RESERVED(id) (id == 2)  // Reserve SPI flash bus.

#if !MICROPY_HW_ENABLE_INTERNAL_FLASH_STORAGE

// Optional: early init to set CS high (implement in board_init.c if desired)
#define MICROPY_BOARD_EARLY_INIT F405_SERGEY_V2_board_early_init
void F405_SERGEY_V2_board_early_init(void);

#define MICROPY_HW_SPIFLASH_ENABLE_CACHE (1)

// Export the block device and its config to storage.c
extern const struct _mp_spiflash_config_t spiflash_config;
extern struct _spi_bdev_t spi_bdev;
#define MICROPY_HW_BDEV_SPIFLASH        (&spi_bdev)
#define MICROPY_HW_BDEV_SPIFLASH_CONFIG (&spiflash_config)

// Size hint (W25Q128 = 128 Mbit = 16 MByte)
#define MICROPY_HW_SPIFLASH_SIZE_BITS       (128 * 1024 * 1024)
#define MICROPY_HW_BDEV_SPIFLASH_SIZE_BYTES (MICROPY_HW_SPIFLASH_SIZE_BITS / 8)

// Whether to automatically mount (and boot from) the flash filesystem
#define MICROPY_HW_ENABLE_STORAGE (1)

#endif

// Stop board-specific ADC DMA before generic timer teardown and GC sweep.
#define MICROPY_BOARD_START_SOFT_RESET F405_OVERRIDE_board_start_soft_reset
void F405_OVERRIDE_board_start_soft_reset(void *state);
